; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	infrared1 - mode
	image0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 image0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
)
(:goal (and
	(pointing satellite3 Star0)
	(have_image Planet5 infrared1)
	(have_image Star6 infrared1)
	(have_image Star7 image0)
	(have_image Star8 image0)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 5
2. (calibrate satellite3 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 5
3. (turn_to satellite3 star7 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star7)
   goals met: 0 of 5
4. (take_image satellite3 star7 instrument4 image0)
   added: (have_image star7 image0)
   goals met: 1 of 5
5. (turn_to satellite3 star6 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star6)
   goals met: 1 of 5
6. (take_image satellite3 star6 instrument4 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 5
7. (turn_to satellite3 planet5 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet5)
   goals met: 2 of 5
8. (take_image satellite3 planet5 instrument4 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 3 of 5
9. (turn_to satellite3 star8 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star8)
   goals met: 3 of 5
10. (take_image satellite3 star8 instrument4 image0)
   added: (have_image star8 image0)
   goals met: 4 of 5
11. (turn_to satellite3 star0 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star0)
   goals met: 5 of 5
